var jsonData = { 
	"instru": 
	{ 
 			//TIPO R
			"add": {"tipo":"r", "inicio":"000000", "fim":"100000"}, 
			"sub": {"tipo":"r", "inicio":"000000", "fim":"100010"},
			"and": {"tipo":"r", "inicio":"000000", "fim":"100100"},
			"or":  {"tipo":"r", "inicio":"000000", "fim":"100101"},
			"nor": {"tipo":"r", "inicio":"000000", "fim":"100111"},
			"slt": {"tipo":"r", "inicio":"000000", "fim":"101010"},
			"jr":  {"tipo":"r", "inicio":"000000", "fim":"001000"},


			//TIPO I
			"addi": {"tipo":"i", "inicio":"010000"},
			"andi": {"tipo":"i", "inicio":"001100"},
			"ori":  {"tipo":"i", "inicio":"001101"},
			
			
			//TIPO J	
            		"j": {"tipo":"j", "inicio":"000010"}, //ainda não funciona
                


//---------------------------ESPECIAIS:  pois há condição especifica p eles----------------------//

			//TIPO R

			"sll": {"tipo":"r2", "inicio":"000000", "fim":"000000"},
			"srl": {"tipo":"r2", "inicio":"000000", "fim":"000010"}, 
			
			//TIPO I:
			"lw": {"tipo":"i2", "inicio":"100011"},
			"sw": {"tipo":"i2", "inicio":"101011"},
			
			
			//TIPO J		   
		   	"jal": {"tipo":"j2", "inicio":"33333"}   //ainda não funciona



    	},
	
    	"registradores":
    	{	
			"$zero":	"00000",
			"$v0":		"00010",
			"$v1":		"00011",
			"$a0":		"00100",
			"$a1":		"00101",
			"$a2":		"00110",
			"$a3":		"00111",
			"$t0": 		"01000",
        		"$t1": 		"01001",
 			"$t2": 		"01010",
			"$t3": 		"01011",
        		"$t4": 		"01100",
 			"$t5": 		"01101",
			"$t6": 		"01110",
			"$t7": 		"01111",
			"$s0": 		"10000",
        		"$s1": 		"10001",
 			"$s2": 		"10010",
			"$s3": 		"10011",
        		"$s4": 		"10100",
 			"$s5": 		"10101",
			"$s6": 		"10110",
			"$s7": 		"10111",
			"$t8": 		"11000",
			"$t9": 		"11001",
			"$k0":		"11010",
			"$k1":		"11011",
			"$gp":		"11100",
			"$sp":		"11101",
			"$fp":		"11110",
        		"$ra":		"11111"
    	} 
};
